* init
  #+begin_src emacs-lisp

    ;; move custom-set-variables and custom-set-faces into another file
    (setq custom-file (concat user-emacs-directory "/custom.el"))
    (load-file custom-file)


    (yas-global-mode)
    (add-hook 'yas-minor-mode-hook (lambda () (yas-activate-extra-mode 'fundamental-mode)))

    ;; store all backup and autosave files in the tmp dir
    (setq backup-directory-alist
	  `((".*" . ,temporary-file-directory)))
    (setq auto-save-file-name-transforms
	  `((".*" ,temporary-file-directory t)))

    ;; packages
    (require 'use-package)

    (add-to-list 'load-path "~/.emacs.d/thirdpartyscripts")

  #+end_src

  #+RESULTS:
  | ~/.emacs.d/thirdpartyscripts | /home/caleb/.emacs.d/elpa/all-the-icons-20210119.2136 | /home/caleb/.emacs.d/elpa/auto-package-update-20200826.2227 | /home/caleb/.emacs.d/elpa/blacken-20200626.2018 | /home/caleb/.emacs.d/elpa/ccls-20200820.308 | /home/caleb/.emacs.d/elpa/clang-format+-20190824.2216 | /home/caleb/.emacs.d/elpa/clang-format-20191121.1708 | /home/caleb/.emacs.d/elpa/company-lsp-20190612.1553 | /home/caleb/.emacs.d/elpa/cquery-20190118.542 | /home/caleb/.emacs.d/elpa/docker-20200610.715 | /home/caleb/.emacs.d/elpa/docker-compose-mode-20200830.1336 | /home/caleb/.emacs.d/elpa/docker-tramp-20170207.325 | /home/caleb/.emacs.d/elpa/dockerfile-mode-20210106.235 | /home/caleb/.emacs.d/elpa/doom-themes-20201220.836 | /home/caleb/.emacs.d/elpa/dracula-theme-20201120.758 | /home/caleb/.emacs.d/elpa/elpy-20201115.1811 | /home/caleb/.emacs.d/elpa/company-20210122.2314 | /home/caleb/.emacs.d/elpa/elpygen-20171225.1736 | /home/caleb/.emacs.d/elpa/emmet-mode-20180613.341 | /home/caleb/.emacs.d/elpa/eyebrowse-20201107.955 | /home/caleb/.emacs.d/elpa/go-mode-20201204.1652 | /home/caleb/.emacs.d/elpa/helm-lsp-20200910.518 | /home/caleb/.emacs.d/elpa/helm-projectile-20201217.908 | /home/caleb/.emacs.d/elpa/helm-20210121.2112 | /home/caleb/.emacs.d/elpa/helm-core-20210120.757 | /home/caleb/.emacs.d/elpa/async-20210117.718 | /home/caleb/.emacs.d/elpa/highlight-indentation-20201110.1327 | /home/caleb/.emacs.d/elpa/hyperbole-7.1.3 | /home/caleb/.emacs.d/elpa/json-mode-20190123.422 | /home/caleb/.emacs.d/elpa/json-reformat-20160212.853 | /home/caleb/.emacs.d/elpa/json-snatcher-20200916.1717 | /home/caleb/.emacs.d/elpa/lsp-treemacs-20201230.2214 | /home/caleb/.emacs.d/elpa/lsp-ui-20210121.1429 | /home/caleb/.emacs.d/elpa/lsp-mode-20210122.947 | /home/caleb/.emacs.d/elpa/dash-functional-20210103.1524 | /home/caleb/.emacs.d/elpa/magit-20210123.446 | /home/caleb/.emacs.d/elpa/git-commit-20210115.2345 | /home/caleb/.emacs.d/elpa/markdown-mode-20210123.1547 | /home/caleb/.emacs.d/elpa/neotree-20200324.1946 | /home/caleb/.emacs.d/elpa/org-attach-screenshot-20201130.1607 | /home/caleb/.emacs.d/elpa/popup-20210108.1821 | /home/caleb/.emacs.d/elpa/popwin-20200908.816 | /home/caleb/.emacs.d/elpa/pyvenv-20201227.1623 | /home/caleb/.emacs.d/elpa/realgud-20201221.1435 | /home/caleb/.emacs.d/elpa/loc-changes-20200722.1111 | /home/caleb/.emacs.d/elpa/load-relative-20201130.2202 | /home/caleb/.emacs.d/elpa/restclient-20200901.1442 | /home/caleb/.emacs.d/elpa/smart-mode-line-20190527.1156 | /home/caleb/.emacs.d/elpa/rich-minority-20190419.1136 | /home/caleb/.emacs.d/elpa/spacemacs-theme-20210206.1428 | /home/caleb/.emacs.d/elpa/spinner-1.7.3 | /home/caleb/.emacs.d/elpa/tablist-20200427.2205 | /home/caleb/.emacs.d/elpa/test-simple-20200722.1121 | /home/caleb/.emacs.d/elpa/tide-20210105.812 | /home/caleb/.emacs.d/elpa/flycheck-20201228.2104 | /home/caleb/.emacs.d/elpa/transient-20210117.2008 | /home/caleb/.emacs.d/elpa/treemacs-projectile-20210107.1251 | /home/caleb/.emacs.d/elpa/treemacs-20210118.1552 | /home/caleb/.emacs.d/elpa/cfrs-20210121.2007 | /home/caleb/.emacs.d/elpa/posframe-20210118.42 | /home/caleb/.emacs.d/elpa/ht-20210119.741 | /home/caleb/.emacs.d/elpa/hydra-20201115.1055 | /home/caleb/.emacs.d/elpa/lv-20200507.1518 | /home/caleb/.emacs.d/elpa/pfuture-20200425.1357 | /home/caleb/.emacs.d/elpa/ace-window-20200606.1259 | /home/caleb/.emacs.d/elpa/avy-20201226.1734 | /home/caleb/.emacs.d/elpa/f-20191110.1357 | /home/caleb/.emacs.d/elpa/s-20180406.808 | /home/caleb/.emacs.d/elpa/dash-20210123.1222 | /home/caleb/.emacs.d/elpa/projectile-20210117.1224 | /home/caleb/.emacs.d/elpa/pkg-info-20150517.1143 | /home/caleb/.emacs.d/elpa/epl-20180205.2049 | /home/caleb/.emacs.d/elpa/typescript-mode-20201002.1109 | /home/caleb/.emacs.d/elpa/use-package-20210106.2145 | /home/caleb/.emacs.d/elpa/bind-key-20200805.1727 | /home/caleb/.emacs.d/elpa/web-beautify-20161115.2247 | /home/caleb/.emacs.d/elpa/web-mode-20201227.1048 | /home/caleb/.emacs.d/elpa/which-key-20201216.1720 | /home/caleb/.emacs.d/elpa/with-editor-20210117.2008 | /home/caleb/.emacs.d/elpa/yaml-mode-20201109.1026 | /home/caleb/.emacs.d/elpa/yasnippet-snippets-20210105.1346 | /home/caleb/.emacs.d/elpa/yasnippet-20200604.246 | /etc/emacs | /usr/local/share/emacs/26.3/site-lisp | /usr/local/share/emacs/site-lisp | /usr/share/emacs/site-lisp/dictionaries-common | /usr/share/emacs/site-lisp/cmake-data | /usr/share/emacs/site-lisp/autoconf | /usr/share/emacs/26.3/site-lisp | /usr/share/emacs/site-lisp | /usr/share/emacs/site-lisp/autoconf | /usr/share/emacs/site-lisp/clang-format | /usr/share/emacs/site-lisp/clang-format-10 | /usr/share/emacs/site-lisp/llvm-10 | /usr/share/emacs/site-lisp/llvm-9 | /usr/share/emacs/26.3/lisp | /usr/share/emacs/26.3/lisp/vc | /usr/share/emacs/26.3/lisp/url | /usr/share/emacs/26.3/lisp/textmodes | /usr/share/emacs/26.3/lisp/progmodes | /usr/share/emacs/26.3/lisp/play | /usr/share/emacs/26.3/lisp/org | /usr/share/emacs/26.3/lisp/nxml | /usr/share/emacs/26.3/lisp/net | /usr/share/emacs/26.3/lisp/mh-e | /usr/share/emacs/26.3/lisp/mail | /usr/share/emacs/26.3/lisp/leim | /usr/share/emacs/26.3/lisp/language | /usr/share/emacs/26.3/lisp/international | /usr/share/emacs/26.3/lisp/image | /usr/share/emacs/26.3/lisp/gnus | /usr/share/emacs/26.3/lisp/eshell | /usr/share/emacs/26.3/lisp/erc | /usr/share/emacs/26.3/lisp/emulation | /usr/share/emacs/26.3/lisp/emacs-lisp | /usr/share/emacs/26.3/lisp/cedet | /usr/share/emacs/26.3/lisp/calendar | /usr/share/emacs/26.3/lisp/calc | /usr/share/emacs/26.3/lisp/obsolete |

* whitespace
  #+begin_src emacs-lisp
;; Show trailing white spaces
(setq-default show-trailing-whitespace nil)

;; Remove useless whitespace before saving a file
(add-hook 'before-save-hook 'whitespace-cleanup)
(add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))

  #+end_src

  #+RESULTS:
  | (lambda nil (delete-trailing-whitespace)) | whitespace-cleanup |

* go
#+begin_src emacs-lisp
  (use-package go-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode))
    (add-hook 'go-mode-hook (lambda ()
			      (lsp-deferred))))

  ;; Set up before-save hooks to format buffer and add/delete imports.
  ;; Make sure you don't have other gofmt/goimports hooks enabled.
  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks)
#+end_src

#+RESULTS:
| lsp-go-install-save-hooks | (lambda nil (lsp-deferred)) |

* rust
#+begin_src emacs-lisp
  (use-package rust-mode
    :config
    (add-hook 'rust-mode-hook
	      (lambda () (progn
			   (setq indent-tabs-mode nil)
			   (lsp))))
    (setq rust-format-on-save t))
#+end_src

#+RESULTS:
| use-package | Cannot load rust-mode | :error | nil |

